# Projet maison n° 4

In [1]:
# imports
import pandas as pd

## 1. US baby names

On va s'intéresser au dataset **National data** de la SSA : https://www.ssa.gov/oact/babynames/limits.html

1. Télécharger le dataset des prénoms US : https://www.ssa.gov/oact/babynames/names.zip

2. Implémenter une fonction Python qui produit un unique DataFrame avec tous les fichiers en utilisant pandas  (par ex. fonction \"concat\" ou méthode \"append\"), pas de bash :)

Ordre et noms des colonnes : 'year', 'name', 'gender', 'births'

Le DataFrame doit être trié selon l'année croissante puis selon l'ordre défini par les différents fichiers (voir la documentation ci-dessus).

In [2]:
# 1) implémentation avec glob + append
import glob

def df_names_us():
    df = pd.DataFrame()
    files = glob.glob('names/*.txt')
    files.sort()
    for filename in files:
        csv = pd.read_csv(filename,
                          names=['name', 'gender', 'births'])
        csv['year'] = int(filename[-8:-4]) # yobAAAA.txt
        df = df.append(csv, ignore_index=True)
    df = df[['year', 'name', 'gender', 'births']]
    return df

In [3]:
%%time
df_us = df_names_us()
df_us.shape

Wall time: 8.86 s

(1989401, 4)

In [4]:
# head
df_us.head()

   year       name gender  births
0  1880       Mary      F    7065
1  1880       Anna      F    2604
2  1880       Emma      F    2003
3  1880  Elizabeth      F    1939
4  1880     Minnie      F    1746

In [5]:
# 2) implémentation avec range + concat
def df_names_us():
    dfs = []
    for year in range(1880, 2020):
        csv = pd.read_csv(f'names/yob{year}.txt',
                          names=['name', 'gender', 'births'])
        csv['year'] = year
        dfs.append(csv)
    df = pd.concat(dfs, ignore_index=True)
    df = df[['year', 'name', 'gender', 'births']]
    return df

In [6]:
%%time
df_us = df_names_us()
df_us.shape

Wall time: 2.42 s

(1989401, 4)

In [7]:
# head
df_us.head()

   year       name gender  births
0  1880       Mary      F    7065
1  1880       Anna      F    2604
2  1880       Emma      F    2003
3  1880  Elizabeth      F    1939
4  1880     Minnie      F    1746

**slice vs regex**

In [8]:
# slice 140 x 96.1ns = ~14ms
%timeit 'yob2020.txt'[-8: -4]

155 ns ± 3.32 ns per loop (mean ± std. dev. of 7 runs, 10000000 loops each)

In [9]:
# regex 140 x 1.37µs = ~192ms (x14)
import re
%timeit re.search('(\d+)', 'yob2020.txt').group(0)

1.45 µs ± 43.9 ns per loop (mean ± std. dev. of 7 runs, 1000000 loops each)

## 2. Prénoms français

On va s'intéresser au dataset **Fichiers France hors Mayotte** de l'INSEE :  https://www.insee.fr/fr/statistiques/2540004/

L'idée est de charger les données et ensuite de les conformer au DataFrame des prénoms US. Ainsi, toute manipulation sur le DataFrame des prénoms US pourra être directement réutilisée avec le DataFrame des prénoms français.
 
1. Télécharger le dataset des prénoms français : https://www.insee.fr/fr/statistiques/fichier/2540004/nat2019_csv.zip


Lire la documentation, ça peut être utile...
 
2. Implémenter une fonction Python qui produit un DataFrame avec les prénoms français en prenant le DataFrame des prénoms US comme modèle :
 
 - Même ordre et mêmes noms des colonnes : year, name, gender, births
 - Mêmes dtypes pour les colonnes
 - Mêmes valeurs pour la colonne 'gender'
 - Seuls les prénoms de 2 caractères et plus sont conservés
 - La casse des prénoms doit être identique : initiales en majuscule, autres lettres en minuscule
 - Les lignes avec des données inutilisables doivent être supprimées
 - Les données sont triées à l'identique : années (↑), puis gender (↑), puis births (↓) et enfin name (↑)
 - L'index du DataFrame doit aller de 0 à N-1

In [10]:
def df_names_fr():
    # genres
    d = {'1': 'M', '2': 'F'}
    # read_csv
    df = pd.read_csv('nat2019.csv',
                      sep=';',
                      header=0,
                      names=['gender', 'name', 'year', 'births'],
                      converters={
                          'gender': d.get,
                          'name': str.title
                      })
    # clean
    df = df.loc[(df['name'].str.len() > 1)
                & (df['year'] != 'XXXX')
                & ~df['name'].str.startswith('_')]
    # types
    df['year'] = df['year'].astype(int)
    # ordre colonnes
    df = df[['year', 'name', 'gender', 'births']]
    # tri
    df = df.sort_values(['year', 'gender', 'births', 'name'],
                   ascending=[True, True, False, True])
    df = df.reset_index(drop=True)
    
    return df

In [11]:
%%time
df_fr = df_names_fr()
df_fr.shape

Wall time: 2.25 s

(615912, 4)

In [12]:
# head
df_fr.head()

   year        name gender  births
0  1900       Marie      F   48713
1  1900      Jeanne      F   13981
2  1900  Marguerite      F    8058
3  1900    Germaine      F    6981
4  1900      Louise      F    6696

In [13]:
df_fr.dtypes

year       int32
name      object
gender    object
births     int64
dtype: object

In [14]:
# prénom NA
df_fr.loc[df_fr['name']=='Na']

        year name gender  births
404212  2003   Na      F       3

In [18]:
# impact du converters / name
d = {'1': 'M', '2': 'F'}

df = pd.read_csv('nat2019.csv',
                  sep=';',
                  header=0,
                  names=['gender', 'name', 'year', 'births'],)
                  #converters={
                  #    'gender': d.get,
                  #    'name': str.title
                  #})

df['name'].isnull().sum()

2

In [21]:
df.isnull().any()

gender    False
name       True
year      False
births    False
dtype: bool

In [16]:
df.loc[df['name'].isnull()]

       gender name  year  births
550787      F  NaN  2003       3
550788      F  NaN  XXXX      28

In [22]:
# capitalize
'JEAN-MARIE'.capitalize()

'Jean-marie'

In [23]:
# title
'JEAN-MARIE'.title()

'Jean-Marie'

In [24]:
# comment faire title avec capitalize :)
'-'.join(map(str.capitalize, 'JEAN-MARIE'.split('-')))

'Jean-Marie'

## 3. Taux de change

On va s'intéresser au dataset des cours des devises de la Banque de France :  http://webstat.banque-france.fr/fr/browseBox.do?node=5385566

L'idée est de charger les données, de les nettoyer et de pouvoir accéder aux cours de certaines devises à partir de leur code ISO3.
 
1. Télécharger le dataset des taux de change : http://webstat.banque-france.fr/fr/downloadFile.do?id=5385698&exportType=csv


2. Implémenter une fonction qui produit un DataFrame avec les taux de change par date pour une liste de codes ISO3 de devises passée en argument. L'index du DataFrame doit correspondre aux dates (voir la fonction pd.to_datetime() avec le format '%d/%m/%Y'). Les colonnes du DataFrame doivent correspondre aux devises.

In [25]:
def df_taux_change(devises):
    df = pd.read_csv("Webstat_Export.csv",
                     sep=";",
                     na_values='-',
                     decimal=',',
                     skiprows=[0, 1, 3, 4, 5],  # le skiprows permet à l'option "decimal" de fonctionner
                     converters={0: lambda x: pd.to_datetime(x, format='%d/%m/%Y', errors='ignore')})

    # extraction des codes monnaies
    cols = pd.Series(df.columns.tolist()).str.extract('\(([A-Z]{3})\)', expand=True)
    cols.iloc[0] = 'Date'
    df.columns = cols[0]

    # selection des devises
    df = df[['Date'] + devises]

    # drop na
    df = df.dropna()

    # set index
    df = df.set_index('Date')
    
    return df

In [26]:
%%time
df_tx = df_taux_change(['CHF', 'GBP', 'USD'])
df_tx.shape

Wall time: 1.53 s

(5574, 3)

In [27]:
# head
df_tx

0              CHF      GBP     USD
Date
2020-10-09  1.0773  0.91167  1.1795
2020-10-08  1.0799  0.91035  1.1765
2020-10-07  1.0787  0.91413  1.1770
2020-10-06  1.0781  0.91058  1.1795
2020-10-05  1.0781  0.90810  1.1768
...            ...      ...     ...
1999-01-08  1.6138  0.70940  1.1659
1999-01-07  1.6165  0.70585  1.1632
1999-01-06  1.6116  0.70760  1.1743
1999-01-05  1.6123  0.71220  1.1790
1999-01-04  1.6168  0.71110  1.1789

[5574 rows x 3 columns]

In [28]:
df_tx.index

DatetimeIndex(['2020-10-09', '2020-10-08', '2020-10-07', '2020-10-06',
               '2020-10-05', '2020-10-02', '2020-10-01', '2020-09-30',
               '2020-09-29', '2020-09-28',
               ...
               '1999-01-15', '1999-01-14', '1999-01-13', '1999-01-12',
               '1999-01-11', '1999-01-08', '1999-01-07', '1999-01-06',
               '1999-01-05', '1999-01-04'],
              dtype='datetime64[ns]', name='Date', length=5574, freq=None)

### Tests

In [ ]:
import unittest

class Lesson4Tests(unittest.TestCase):
    def test_df_names_us(self):
        df = df_names_us()
        # colonnes
        self.assertEqual(list(df.columns), ['year', 'name', 'gender', 'births'])
        # lignes
        self.assertEqual(len(df), 1989401)
        # index
        self.assertTrue(isinstance(df.index, pd.core.indexes.range.RangeIndex))
        # test NaN
        self.assertTrue(df.loc[df.isnull().any(axis=1)].empty)
        
    def test_df_names_fr(self):
        df = df_names_fr()
        # colonnes
        self.assertEqual(list(df.columns), ['year', 'name', 'gender', 'births'])
        # lignes
        self.assertEqual(len(df), 615912)
        # index
        self.assertTrue(isinstance(df.index, pd.core.indexes.range.RangeIndex))
        # test names
        self.assertTrue(df.loc[df['name'].str.contains('^[A-Z]+(?:-[A-Z]+)?$')].empty)
        # test gender
        self.assertEqual(len(df), len(df.loc[df['gender']=='F']) + len(df.loc[df['gender']=='M']))
        # test NaN
        self.assertTrue(df.loc[df.isnull().any(axis=1)].empty)

    def test_df_taux_change(self):
        df = df_taux_change(['CHF', 'GBP', 'USD'])
        # colonnes
        self.assertEqual(list(df.columns), ['CHF', 'GBP', 'USD'])
        # index
        self.assertTrue(isinstance(df.index, pd.core.indexes.datetimes.DatetimeIndex))
        # types taux
        self.assertTrue((df.dtypes == 'float').all())
        # test NaN
        self.assertTrue(df.loc[df.isnull().any(axis=1)].empty)

In [ ]:
# run tests
def run_tests():
    test_suite = unittest.makeSuite(Lesson4Tests)
    runner = unittest.TextTestRunner(verbosity=2)
    runner.run(test_suite)

In [ ]:
# run tests

run_tests()

### Un peu de Data Science...

**Question n° 1**

Pourquoi le value_counts() du "gender" donne-t-il un tel écart entre F et M ?

In [29]:
# value_counts du gender

df_us['gender'].value_counts()

F    1174655
M     814746
Name: gender, dtype: int64

In [30]:
# value_counts du gender

df_fr['gender'].value_counts()

F    335205
M    280707
Name: gender, dtype: int64

In [31]:
# pct_change

df_us['gender'].value_counts().pct_change()

F         NaN
M   -0.306395
Name: gender, dtype: float64

In [32]:
# pct_change

df_fr['gender'].value_counts().pct_change()

F         NaN
M   -0.162581
Name: gender, dtype: float64

In [33]:
# Marie F 10
# Sophie F 10
# Isabelle F 10
# Jean M 30

In [34]:
# F 3
# M 1

**Question n° 2**

Pourquoi le value_counts() du "name" donne-t-il ce résultat ?

In [35]:
# value_counts du gender

df_us['name'].value_counts().head(16)

Joseph     280
William    280
Ollie      280
Jean       280
Sidney     280
Johnnie    280
Tommie     280
James      280
Marion     280
Jessie     280
Leslie     280
Lee        280
Jesse      280
John       280
Francis    280
Charles    279
Name: name, dtype: int64

In [36]:
# value_counts du gender

df_fr['name'].value_counts().head(16)

Camille      240
Alix         240
Ange         240
Dominique    237
Claude       233
Hyacinthe    229
Maxime       228
Marie        212
Gaby         208
Cyrille      207
Elie         200
Andréa       199
France       198
Irène        195
Léandre      195
Stéphane     193
Name: name, dtype: int64

**Question n° 3**

Pourquoi le value_counts() du "year" donne-t-il ce résultat ?

In [37]:
# value_counts du gender

df_us['year'].value_counts().head(16)

2008    35084
2007    34962
2009    34715
2006    34094
2010    34082
2011    33915
2012    33757
2013    33296
2014    33266
2015    33138
2016    33028
2017    32629
2005    32551
2018    32162
2004    32049
2019    31954
Name: year, dtype: int64

In [38]:
# value_counts du gender

df_fr['year'].value_counts().head(16)

2014    13878
2012    13829
2013    13786
2011    13683
2015    13583
2016    13482
2017    13421
2010    13338
2018    13318
2019    13138
2009    12386
2008    12245
2007    12111
2006    11914
2005    11382
2004    10976
Name: year, dtype: int64

**Exercice n° 1**

Donnez le prénom qui a été le plus donné lors d'une année.

In [41]:
df_us.loc[df_us['births'].idxmax()]

year       1947
name      Linda
gender        F
births    99690
Name: 431067, dtype: object

In [42]:
df_fr.loc[df_fr['births'].idxmax()]

year       1946
name       Jean
gender        M
births    53624
Name: 95566, dtype: object

**Exercice n° 2**

Donnez la liste des prénoms qui contiennent dans l'ordre a, e, i, o et u (US) ou bien a, e, i et o (FR).

In [43]:
df_us.loc[df_us['name'].str.contains('a.*e.*i.*o.*u'), 'name'].unique()

array(['Laprecious', 'Markevious', 'Laderious', 'Jakevious',
       'Quanterious', 'Quanterrious', 'Latrevious', 'Jaterrious',
       'Jamerious', 'Jaderious', 'Marquevious', 'Laterrious', 'Jaterious',
       'Dametrious'], dtype=object)

In [46]:
df_fr.loc[df_fr['name'].str.contains('a.*e.*i.*o'), 'name'].unique()

array(['Marie-Philomene', 'Marie-Victorine', 'Marie-Victoire',
       'Marie-Simone', 'Marcelino', 'Valerio', 'Valentino', 'Valeriano',
       'Saverio', 'Marie-Nicole', 'Marie-Violaine', 'Marie-Mimose',
       'Marie-Victoria', 'Marcellino', 'Maria-Conception',
       'Marie-Christophe', 'Laurentino', 'Charles-Victor',
       'Charles-Nicolas', 'Marie-Violette', 'Maelio'], dtype=object)

### Méthodes de reshaping (1)

#### pivot_table

La méthode pivot_table() prend en argument :
- values : valeurs qui doivent être agrégées selon les modalités de la colonne passée en "index" et de la colonne passée en "columns"
- index : colonne(s) dont les valeurs vont servir d'index à la table pivot
- columns : colonne(s) dont les valeurs vont servir de colonnes à la table pivot
- aggfunc : fonction d'aggrégation des values, par défaut 'mean', 'median', 'min', 'max', 'count', 'sum', 'nunique', et n'importe quelle lambda ou liste de fonctions.

On obtient NaN s'il n'y a pas d'occurence croisée.

Excel = tableau croisé dynamique.

In [47]:
# exemple
df = pd.DataFrame([{'A': 1,'B': 1, 'C': 1},
                   {'A': 1,'B': 1, 'C': 2},
                   {'A': 1,'B': 2, 'C': -1},
                   {'A': 2,'B': 1, 'C': 4},
                   {'A': 2,'B': 1, 'C': 5},
                  ])

df

   A  B  C
0  1  1  1
1  1  1  2
2  1  2 -1
3  2  1  4
4  2  1  5

In [48]:
# exemple
df.pivot_table(values='C',
              index='A',
              columns='B',
              aggfunc='mean')

B    1    2
A
1  1.5 -1.0
2  4.5  NaN

**Exercice n° 3**

Calculez une table pivot avec le nombre total de naissances par année et par genre.

In [49]:
df_us.pivot_table(values='births',
              index='year',
              columns='gender',
              aggfunc='sum')

gender        F        M
year
1880      90994   110490
1881      91953   100743
1882     107847   113686
1883     112319   104625
1884     129019   114442
...         ...      ...
2015    1781725  1913059
2016    1767902  1893471
2017    1721550  1845472
2018    1694640  1809166
2019    1665373  1779948

[140 rows x 2 columns]

In [50]:
df_fr.pivot_table(values='births',
              index='year',
              columns='gender',
              aggfunc='sum')

gender       F       M
year
1900    235924  176132
1901    255718  194606
1902    259689  203009
1903    259685  206062
1904    263009  212691
...        ...     ...
2015    352479  373775
2016    344472  365626
2017    337400  357862
2018    331544  352642
2019    329068  347947

[120 rows x 2 columns]

**Exercice n° 4**

Calculez une table pivot avec la diversité des prénoms (nombre de prénoms distincts) par année et par genre.

In [51]:
df_us.pivot_table(values='name',
              index='year',
              columns='gender',
              aggfunc='nunique')

gender      F      M
year
1880      942   1058
1881      938    997
1882     1028   1099
1883     1054   1030
1884     1172   1125
...       ...    ...
2015    19099  14039
2016    18847  14181
2017    18400  14229
2018    18100  14062
2019    17905  14049

[140 rows x 2 columns]

In [56]:
df_us.pivot_table(values='name',
              index='year',
              #columns='gender',
              aggfunc='nunique')

       name
year
1880   1889
1881   1830
1882   2012
1883   1962
1884   2158
...     ...
2015  30619
2016  30429
2017  30039
2018  29606
2019  29351

[140 rows x 1 columns]

In [52]:
df_fr.pivot_table(values='name',
              index='year',
              columns='gender',
              aggfunc='nunique')

gender     F     M
year
1900     983   723
1901    1010   719
1902    1019   721
1903    1020   737
1904    1013   765
...      ...   ...
2015    7255  6328
2016    7163  6319
2017    7131  6290
2018    7021  6297
2019    6978  6160

[120 rows x 2 columns]

In [55]:
pd.DataFrame.pivot_table?

#### crosstab

crosstab() est une fonction de reshaping qui prend 2 colonnes d'un DataFrame en argument et produit le décompte croisé des occurrence.

On obtient 0 s'il n'y a pas d'occurence croisée.

In [57]:
# exemple
pd.crosstab(df['A'], df['B'])

B  1  2
A
1  2  1
2  2  0

In [58]:
# initial
df_us['initial'] = df_us['name'].str[0].str.upper()
# terminal
df_us['terminal'] = df_us['name'].str[-1].str.upper()

df_us.head()

   year       name gender  births initial terminal
0  1880       Mary      F    7065       M        Y
1  1880       Anna      F    2604       A        A
2  1880       Emma      F    2003       E        A
3  1880  Elizabeth      F    1939       E        H
4  1880     Minnie      F    1746       M        E

In [63]:
# crosstab
pd.crosstab(df_us['initial'], df_us['terminal'], normalize=True, margins=True)*100

terminal,A,B,C,D,E,F,G,H,I,J,...,R,S,T,U,V,W,X,Y,Z,All
initial,,,,,,,,,,,,,,,,,,,,,
A,3.210263,0.018599,0.036041,0.157836,1.516838,0.025334,0.010305,0.558460,0.408364,0.014929,...,0.321755,0.489796,0.119182,0.032472,0.015281,0.021112,0.029858,0.438323,0.037851,9.894486
B,0.643460,0.011863,0.007540,0.150095,0.791293,0.002212,0.008998,0.121896,0.115110,0.003820,...,0.127274,0.099980,0.191063,0.016890,0.002614,0.011863,0.013672,0.451995,0.015884,4.065545
C,1.459434,0.021011,0.018699,0.105660,1.567155,0.010104,0.039660,0.093294,0.185684,0.003167,...,0.282648,0.350055,0.110888,0.008294,0.000302,0.001659,0.003519,0.591736,0.037348,6.883228
D,1.594952,0.002161,0.053785,0.153916,1.315773,0.002161,0.018196,0.185986,0.224741,0.004976,...,0.107067,0.409973,0.069870,0.009350,0.007590,0.020810,0.008596,0.429928,0.018950,6.736550
E,1.148436,0.007188,0.024882,0.123907,0.883985,0.002413,0.013321,0.212577,0.100030,0.002564,...,0.232130,0.141600,0.170654,0.022620,0.000653,0.002714,0.008495,0.223384,0.006334,4.591030
F,0.418015,0.000000,0.014276,0.075098,0.281341,0.000000,0.009551,0.047150,0.023525,0.000302,...,0.060873,0.105107,0.039660,0.002865,0.000000,0.000050,0.016085,0.106414,0.033829,1.715692
G,0.529908,0.003117,0.000905,0.127576,0.602292,0.009852,0.025234,0.050015,0.090982,0.001156,...,0.111943,0.120338,0.096562,0.000905,0.009902,0.000000,0.000101,0.227656,0.001106,2.891272
H,0.297627,0.010807,0.000955,0.132854,0.323866,0.004775,0.024530,0.123153,0.108827,0.000352,...,0.121645,0.088720,0.114808,0.009299,0.000352,0.005630,0.003770,0.292802,0.006032,2.465818
I,0.524882,0.000201,0.037448,0.020257,0.178446,0.000704,0.011360,0.084498,0.051624,0.000452,...,0.043430,0.081834,0.010003,0.010053,0.000101,0.000000,0.000000,0.085202,0.015130,1.550416
J,1.256006,0.050920,0.018699,0.158942,1.737608,0.020710,0.006434,0.381522,0.370312,0.003468,...,0.195838,0.349000,0.117271,0.008746,0.001005,0.004222,0.005831,0.475570,0.029456,7.538651
K,1.462852,0.028099,0.016890,0.054991,0.952347,0.016538,0.032924,0.327435,0.519654,0.003569,...,0.175983,0.110586,0.061526,0.026742,0.005680,0.002664,0.010254,0.517543,0.009701,6.427864
L,2.217602,0.003016,0.016638,0.157334,1.399316,0.013270,0.024882,0.199356,0.211621,0.001810,...,0.152961,0.251231,0.083844,0.029155,0.007741,0.012164,0.025334,0.435106,0.037197,6.744040
M,2.036342,0.008294,0.033176,0.161707,1.652206,0.001156,0.025284,0.338997,0.390469,0.007992,...,0.137479,0.343219,0.163366,0.050568,0.005982,0.035639,0.039560,0.527043,0.050970,8.251981
N,1.038353,0.004926,0.003117,0.047150,0.411028,0.002966,0.004423,0.205137,0.240776,0.006132,...,0.076757,0.185332,0.034081,0.007188,0.006082,0.001960,0.001609,0.116920,0.003117,3.063133
O,0.448879,0.000000,0.001206,0.038404,0.280034,0.007942,0.001860,0.022067,0.051624,0.000101,...,0.079019,0.090027,0.007339,0.005379,0.000251,0.000050,0.004775,0.040615,0.002413,1.490599
P,0.392329,0.000050,0.011059,0.004373,0.356037,0.000000,0.016688,0.031014,0.054841,0.001609,...,0.100583,0.157133,0.046396,0.003820,0.004423,0.000603,0.015130,0.159646,0.009752,1.832361
Q,0.081080,0.000000,0.001357,0.001759,0.030964,0.000000,0.002111,0.006032,0.006283,0.000000,...,0.008797,0.025937,0.004876,0.000101,0.000000,0.000000,0.000000,0.029155,0.006937,0.333517
R,1.158791,0.013120,0.014426,0.323213,0.847642,0.021564,0.002664,0.179049,0.180959,0.007138,...,0.105559,0.138785,0.088016,0.006384,0.009249,0.002161,0.010506,0.392229,0.011813,5.211167
S,2.139538,0.015985,0.005379,0.168091,1.117774,0.019604,0.047904,0.355987,0.333568,0.015934,...,0.315120,0.121896,0.101237,0.022469,0.010003,0.014979,0.000704,0.473610,0.013321,6.998187
T,1.871418,0.006132,0.009249,0.079421,0.746757,0.002413,0.024530,0.185282,0.246154,0.014829,...,0.209963,0.266110,0.053031,0.015180,0.002413,0.004725,0.005680,0.405047,0.020358,5.447720
U,0.061777,0.000000,0.003066,0.002161,0.017493,0.000050,0.000151,0.019654,0.009651,0.000251,...,0.011109,0.035136,0.000503,0.003217,0.000302,0.000000,0.000000,0.004021,0.000050,0.239519
V,0.711571,0.000000,0.005127,0.013220,0.360762,0.000050,0.004976,0.017342,0.060873,0.003921,...,0.059113,0.039710,0.047351,0.004725,0.004775,0.000000,0.000000,0.074746,0.002161,1.816828
W,0.202372,0.006736,0.000452,0.121243,0.189856,0.004876,0.007490,0.024329,0.017040,0.000151,...,0.126118,0.047703,0.062129,0.001106,0.000000,0.021413,0.000000,0.133608,0.000201,1.379762
X,0.044737,0.000000,0.001106,0.000000,0.009500,0.000000,0.002664,0.004323,0.009953,0.000000,...,0.030260,0.004072,0.003318,0.000503,0.000000,0.000000,0.000000,0.005027,0.000000,0.152760
Y,0.270584,0.005379,0.000402,0.009752,0.095355,0.024982,0.022921,0.028853,0.099477,0.001357,...,0.035438,0.040967,0.020107,0.005529,0.012064,0.002564,0.001257,0.057756,0.005982,1.005428
Z,0.460943,0.021715,0.005379,0.023374,0.138987,0.001307,0.002815,0.146175,0.062984,0.000000,...,0.054640,0.022570,0.004021,0.001106,0.005077,0.000201,0.000101,0.076857,0.000553,1.272443
All,25.682153,0.239318,0.341258,2.412334,17.804656,0.194983,0.391877,3.949581,4.175126,0.099980,...,3.283501,4.116817,1.821101,0.304665,0.111843,0.167186,0.204836,6.771938,0.376445,100.000000

In [60]:
pd.crosstab?

In [65]:
# pivot_table
df_us.pivot_table(values='name',
                  index='initial',
                  columns='terminal',
                  aggfunc='nunique').fillna(0).astype(int)

terminal,A,B,C,D,E,F,G,H,I,J,...,Q,R,S,T,U,V,W,X,Y,Z
initial,,,,,,,,,,,,,,,,,,,,,
A,3551,33,28,152,1458,26,19,905,569,22,...,14,321,480,141,56,30,18,16,428,64
B,718,7,9,74,611,3,14,153,147,5,...,0,117,75,99,20,2,9,20,329,20
C,1545,22,21,57,1230,6,29,170,201,1,...,0,195,233,71,22,2,4,5,368,24
D,1737,5,28,120,1192,2,17,305,323,10,...,1,132,356,59,11,5,6,13,391,33
E,920,9,21,78,704,3,8,250,152,3,...,1,159,142,94,15,2,7,6,203,17
F,376,0,8,39,190,0,5,48,35,1,...,5,52,69,22,7,0,1,8,78,23
G,452,7,4,86,451,7,17,54,106,6,...,0,82,111,53,4,6,0,2,148,8
H,289,12,6,75,296,5,21,147,128,3,...,3,104,71,70,20,2,1,7,178,8
I,539,1,21,20,176,3,4,108,93,2,...,5,49,84,23,16,1,0,0,74,10
J,1692,45,19,125,1408,10,18,511,426,4,...,0,268,367,95,16,4,11,8,398,59
K,2024,38,15,59,1041,21,36,465,586,5,...,4,265,169,48,50,11,7,11,403,20
L,2207,5,23,96,953,7,19,287,257,3,...,1,133,200,85,14,10,8,23,312,23
M,2070,25,27,141,1303,4,26,477,499,12,...,7,150,342,126,55,13,22,35,414,75
N,1216,8,3,32,426,7,12,359,272,10,...,0,104,160,43,20,8,5,4,138,15
O,400,0,3,30,187,4,2,45,90,1,...,0,63,76,12,16,1,1,3,51,5
P,407,1,6,11,260,0,20,54,80,3,...,0,58,118,48,7,7,1,14,104,8
Q,182,0,1,2,52,0,2,15,14,0,...,0,16,51,7,1,0,0,0,30,7
R,1184,17,10,204,653,15,7,231,180,6,...,4,132,115,80,17,14,3,5,238,20
S,2873,26,9,145,1174,22,35,541,458,21,...,10,302,139,135,42,14,10,5,373,32
T,2428,9,19,65,797,9,43,316,295,13,...,16,220,277,38,24,3,4,3,281,27
U,105,0,1,8,31,1,2,22,16,1,...,0,13,31,4,5,2,0,0,6,1
V,588,0,3,18,270,1,5,52,63,4,...,0,37,48,43,8,10,0,0,64,4
W,219,2,3,73,168,5,6,38,21,1,...,0,71,35,31,3,0,9,0,79,3
X,80,0,1,0,20,0,7,19,21,0,...,0,36,12,3,4,0,0,0,14,0
Y,417,11,1,13,126,21,25,66,196,3,...,0,62,61,31,10,11,2,1,122,17
Z,592,24,4,22,209,2,9,263,130,0,...,0,112,45,12,3,3,1,1,102,2

In [66]:
# Z x Z
df_us.loc[(df_us['initial'] == 'Z') & (df_us['terminal'] == 'Z')]

         year    name gender  births initial terminal
1332909  1999  Zyquez      M       5       Z        Z
1551417  2006  Zyquez      M       6       Z        Z
1583762  2007  Zyquez      M       8       Z        Z
1616535  2008  Zyquez      M      11       Z        Z
1721411  2011  Zyquez      M       8       Z        Z
1826482  2014  Zoraiz      M       5       Z        Z
1854310  2015  Zoraiz      M       9       Z        Z
1889192  2016  Zoraiz      M       7       Z        Z
1921806  2017  Zoraiz      M       7       Z        Z
1952182  2018  Zoraiz      M       9       Z        Z
1983503  2019  Zoraiz      M      10       Z        Z

In [67]:
# Z x Z
df_us.loc[df_us['name'].str.startswith('Z') & df_us['name'].str.endswith('z')]

         year    name gender  births initial terminal
1332909  1999  Zyquez      M       5       Z        Z
1551417  2006  Zyquez      M       6       Z        Z
1583762  2007  Zyquez      M       8       Z        Z
1616535  2008  Zyquez      M      11       Z        Z
1721411  2011  Zyquez      M       8       Z        Z
1826482  2014  Zoraiz      M       5       Z        Z
1854310  2015  Zoraiz      M       9       Z        Z
1889192  2016  Zoraiz      M       7       Z        Z
1921806  2017  Zoraiz      M       7       Z        Z
1952182  2018  Zoraiz      M       9       Z        Z
1983503  2019  Zoraiz      M      10       Z        Z